/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

功能：求出二维数组中的最大元素值。

-------------------------------------------------------*/

#include <stdio.h>

/***********SPACE***********/
int max_value(int m,int n,int array[3][4])
{
  int i,j,max;
  max=array[0][0];
  for(i=0;i<m;i++)
    for(j=0;j<n;j++)
      /***********SPACE***********/
      if(max<array[i][j])max=array[i][j];
  return(max);
}

void main()
{
  int a[3][4]={{1,3,5,7},{2,4,6,8},{15,17,34,12}};
  /***********SPACE***********/
  printf("max value is %d\n",max_value(3,4,a));
}
